#include <stdio.h>

int main(void) {

	// 배열 형태
	// int arr[3];
	// ㅁㅁㅁ

	// 다차원 배열 형태
	// int arr_1[2][5]; // 5개짜리 배열이 2개
	// ㅁㅁㅁㅁㅁ
	// ㅁㅁㅁㅁㅁ

	// int arr_2[4][2]; // 2개짜리 배열이 4새
	// ㅁㅁ
	// ㅁㅁ
	// ㅁㅁ
	// ㅁㅁ

	// 3차원 배열 형태
	// int arr_3[3][3][3]; // 3개짜리 배열을 3개가진 배열이 3개
	
	// ㅁㅁㅁ
	// ㅁㅁㅁ
	// ㅁㅁㅁ

	// ㅁㅁㅁ
	// ㅁㅁㅁ
	// ㅁㅁㅁ
	
	// ㅁㅁㅁ
	// ㅁㅁㅁ
	// ㅁㅁㅁ

	int arr[5] = { 1,2,3,4,5 };

	// 다차원 배열 선언 및 사용
	int arr_1[2][5] = {
		{ 1,2,3,4,5 },
		{ 6,7,8,9,10 }
	};

	for (int i = 0; i < 2; i++) {
		for (int k = 0; k < 5; k++) {
			printf("< [%d][%d] > 번째 값은 : %d\n", i, k, arr_1[i][k]);
		}
		printf("\n\n");
	}


	int arr_2[4][2] = {
		{1,2},
		{3,4},
		{5,6},
		{7,8}
	};

	for (int i = 0; i < 4; i++) {
		for (int k = 0; k < 2; k++) {
			printf("< [%d][%d] > 번째 값은 : %d\n", i, k, arr_2[i][k]);
		}
		printf("\n\n");
	}

	int arr_3[3][3][3] = {
		{
			{1,2,3},
			{4,5,6},
			{7,8,9}
		},

		{
			{10,11,12},
			{13,14,15},
			{16,17,18}
		},

		{
			{19,20,21},
			{22,23,24},
			{25,26,27}
		},
		
	};

	for (int i = 0; i < 3; i++) {
		for (int k = 0; k < 3; k++) {
			for (int j = 0; j < 3; j++) {
				printf("< [%d][%d][%d] > 번째 값은 : %d\n", i, k, j, arr_3[i][j][k]);
			}
		}
		printf("\n\n");
	}

	return 0;
}